AccumulationRegisters/ТоварыВЯчейках.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ТоварыВЯчейках</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПроблемнаяЯчейка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Ячейки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Ячейка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Ячейки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГМ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ТоварыВЯчейках/Ext/RecordSetModule.bsl
//МакароваМ << 07.12.2015 ID_1212

Перем мПериод          Экспорт; // Период движений
Перем мТаблицаДвижений Экспорт; // Таблица движений
Перем МетаданныеДокумента, МетаданныеТабЧасти, ИмяДокумента, ИмяТабличнойЧасти, ИмяТаблицы, Заголовок, СтруктураШапкиДокумента, Отказ; 

// Выполняет приход по регистру.
//
// Параметры:
//  Нет.
//
Процедура ВыполнитьПриход() Экспорт

	ОбщегоНазначения.ВыполнитьДвижениеПоРегистру(ЭтотОбъект, ВидДвиженияНакопления.Приход);

КонецПроцедуры // ВыполнитьПриход()

// Выполняет расход по регистру.
//
// Параметры:
//  Нет.
//
Процедура ВыполнитьРасход() Экспорт

	ОбщегоНазначения.ВыполнитьДвижениеПоРегистру(ЭтотОбъект, ВидДвиженияНакопления.Расход);

КонецПроцедуры // ВыполнитьРасход()

// Выполняет движения по регистру.
//
// Параметры:
//  Нет.
//
Процедура ВыполнитьДвижения() Экспорт

	Загрузить(мТаблицаДвижений);

КонецПроцедуры // ВыполнитьДвижения()

// Процедура контролирует остаток по данному регистру по переданному документу
// и его табличной части. В случае недостатка товаров выставляется флаг отказа и 
// выдается сообщение.
//
// Параметры:
//  ДокументОбъект     - объект проводимого документа, 
//  ТабЯчеек        	- таблица значений, 
//  СтруктураШапки     - структура, содержащая значения "через точку" ссылочных реквизитов по шапке документа,
//  ОтказПроведения    - флаг отказа в проведении,
//  ЗаголовокСообщения - строка, заголовок сообщения об ошибке проведения.
Процедура КонтрольОстатков(ДокументОбъект, ТабЯчеек, СтруктураШапки, ОтказПроведения, ЗаголовокСообщения) Экспорт
		
	МетаданныеДокумента = ДокументОбъект.Метаданные();
	ИмяДокумента        = МетаданныеДокумента.Имя;
	
	Если ИмяДокумента = "КорректировкаПоступления" ИЛИ ИмяДокумента = "ВыкупСОтветственногоХранения" Тогда
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ВидДвижения", ВидДвиженияНакопления.Расход);
		Запрос.УстановитьПараметр("МоментВремени", ДокументОбъект.МоментВремени());
		Запрос.УстановитьПараметр("ТЗ", ТабЯчеек);
		
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТЗ.Номенклатура КАК Номенклатура,
		|	ТЗ.Склад КАК Склад,
		|	ТЗ.Ячейка КАК Ячейка,
		|	ТЗ.ВидДвижения КАК ВидДвижения,
		|	ТЗ.Количество КАК Количество
		|ПОМЕСТИТЬ ТЗ
		|ИЗ
		|	&ТЗ КАК ТЗ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТЗ.Номенклатура,
		|	ТЗ.Склад,
		|	ТЗ.Ячейка,
		|	СУММА(ТЗ.Количество) КАК Количество
		|ПОМЕСТИТЬ ТЗСвернутая
		|ИЗ
		|	ТЗ КАК ТЗ
		|ГДЕ
		|	ТЗ.ВидДвижения = &ВидДвижения
		|
		|СГРУППИРОВАТЬ ПО
		|	ТЗ.Склад,
		|	ТЗ.Ячейка,
		|	ТЗ.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТЗСвернутая.Номенклатура,
		|	ТЗСвернутая.Склад,
		|	ТЗСвернутая.Ячейка,
		|	ЕСТЬNULL(ТоварыВЯчейкахОстатки.КоличествоОстаток, 0) - ТЗСвернутая.Количество КАК Количество,
		|	ТоварыВЯчейкахОстатки.КоличествоОстаток КАК Свободно,
		|	ТЗСвернутая.Количество КАК Требуется
		|ИЗ
		|	ТЗСвернутая КАК ТЗСвернутая,
		|	РегистрНакопления.ТоварыВЯчейках.Остатки(
		|			&МоментВремени,
		|			(Номенклатура, Склад, Ячейка) В
		|				(ВЫБРАТЬ
		|					ТЗСвернутая.Номенклатура,
		|					ТЗСвернутая.Склад,
		|					ТЗСвернутая.Ячейка
		|				ИЗ
		|					ТЗСвернутая КАК ТЗСвернутая)) КАК ТоварыВЯчейкахОстатки
		|ГДЕ
		|	ЕСТЬNULL(ТоварыВЯчейкахОстатки.КоличествоОстаток, 0) - ТЗСвернутая.Количество < 0
		|
		|ДЛЯ ИЗМЕНЕНИЯ";
		
		РезультатЗапроса = Запрос.Выполнить();
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			ОтказПроведения = Истина;
			СтрокаСообщения = "Остатка товара "+ Выборка.Номенклатура +" на складе "+ Выборка.Склад + " в ячейке "+ Выборка.Ячейка+" недостаточно.";
			УправлениеЗапасами.ОшибкаНетОстатка(СтрокаСообщения, Выборка.Свободно , Выборка.Требуется, "", ОтказПроведения, Заголовок);
		КонецЦикла;
		
	Иначе
		// Сообщить("Для документа "+ДокументОбъект+" не предусмотрен вызов процедуры 'Контроль остатков' модуля регистра 'Товары на складах'");
	КонецЕсли;

КонецПроцедуры // КонтрольОстатков()

//МакароваМ >>  >>
